/**
 ******************************************************************************
 * @file    motioncmd.h
 * @author  apex-CoreXY Project
 * @brief   �˶��������ݽṹ����
 *
 * @details
 * MotionCmd �������˶�����ϵͳ���������塣
 *
 * ��������
 *
 *      Parser
 *         ��
 *         ��
 *     MotionCmd
 *         ��
 *         ��
 *   Command Queue
 *         ��
 *         ��
 *      Planner
 *         ��
 *         ��
 *   Motor Driver
 *
 * ���ļ�ֻ�����˶���������ݽṹ�����漰�κ��˶������㷨��
 ******************************************************************************
 */
#ifndef MOTIONCMD_H
#define MOTIONCMD_H
//�˶�����
#include "main.h"

/**
 * @brief �˶�����
 *
 * Ŀǰ��֧�֣�
 * G0�������ƶ�
 * G1��ֱ���˶�
 *
 * ��������չ��
 * G2��G3 ��Բ���岹��
 */
typedef enum
{
    MOTION_G0=0,    
    MOTION_G1       
} MotionType;

/**
 * @brief һ���˶�����
 *
 * @note
 * Queue �б������Զ���������ꡣ
 */
typedef struct
{
    MotionType type;     /**< G0 �� G1 */

    float x;             /**< Ŀ�� X ���꣨mm�� */

    float y;             /**< Ŀ�� Y ���꣨mm�� */

} MotionCmd;
#endif
